//
//  QuestionManager.swift
//  WhoWantToBeMillionaireChallenge
//
//  Created by Артем Орлов on 01.11.2022.
//

import Foundation

import Foundation

struct QuestionManager {
    let question = [
        Question(q: "Способностью к быстрой смене чего славятся хамелеоны?", a: ["Цвета", "Размера", "Пола", "Убеждений"], correctAnswer: "Цвета"),
        Question(q: "Что сочиняют спецагентам, отправляя их на задание?", a: ["Сказку", "Былину", "Легенду", "Притчу"], correctAnswer: "Легенду"),
        Question(q: "Как называют человека, воздерживающегося от употребления мяса?", a: ["Абстинент", "Каннибал", "Вегетарианец", "Пуританин"], correctAnswer: "Вегетарианец"),
        Question(q: "Как звали Колумба?", a: ["Христофор", "Америгго", "Хуан", "Дуремар"], correctAnswer: "Христофор"),
        Question(q: "Назовите столицу Суринама?", a: ["Ханой", "Парамарибо", "Мадрас", "Улан-Батор"], correctAnswer: "Парамарибо"),
        Question(q: "В какой из этих игр используется мяч наибольшей величины?", a: ["Баскетбол", "Футбол", "Волейбол", "Водное поло"], correctAnswer: "Баскетбол"),
        Question(q: "Какое из этих красных грузинских вин - полусладкое?", a: ["Телиани", "Саперави", "Легенду", "Мукузани"], correctAnswer: "Ахашени"),
        Question(q: "В каком штате США расположен город Солт-Лейк-Сити - столица Зимней Олимпиады 2002 года?", a: ["Нью-Хемпшир", "Колорадо", "Висконсин", "Юта"], correctAnswer: "Юта"),
        Question(q: "Какая олимпийская дистанция плавания самая длинная?", a: ["800 м", "1000 м", "1500 м", "3000 м"], correctAnswer: "1500 м"),
        Question(q: "Как называется певучее исполнение на музыкальных инструментах (подражание пению)?", a: ["Кантилена", "Канцона", "Кантабиле", "Тремоло"], correctAnswer: "Кантабиле"),
        Question(q: "Гражданином какой страны был открыватель пенициллина Александр Флеминг?", a: ["США", "Швейцария", "Великобритания", "Канада"], correctAnswer: "Великобритания"),
        Question(q: "Как в старину на флоте называли горячий чай с лимоном, сдобренный значительной порцией рома?", a: ["Адвокат", "Батя", "Атаман", "Браток"], correctAnswer: "Адвокат"),
        Question(q: "Какой из этих российских орденов был младше остальных?", a: ["Станислав 2-й степени", "Анна 2-й степени", "Владимир 4-й степени", "Белый Орел"], correctAnswer: "Станислав 2-й степени"),
        Question(q: "Что из этого является изюмом с косточками?", a: ["Сабза", "Кайса", "Вассарга", "Сарга"], correctAnswer: "Вассарга"),
        Question(q: "Какой сигнал на российских морских пляжах означает запрет на купание?", a: ["Черный шар", "Черный флаг", "Желтый шар", "Желтый флаг"], correctAnswer: "Черный шар")
    ]
}
